Repository: puavo-org/puavo-os
Catalog: parts/laptop-setup/po/*/puavo-laptop-setup.po
Languages: de, fi, sv

source: It is now possible to choose Windows from the boot menu when starting up the computer.
de: Es ist jetzt möglich Windows beim Startmenü wählen. Das Menü wird kurz nach dem Einschalten von dem Computer gezeigt.
fi: Windows on nyt lisätty käynnistysvaihtoehdoksi tietokoneen käynnistysvalikkoon. Käynnistysvalikko tulee näkyviin aina tietokoneen uudelleen käynnistyksen yhteydessä.
sv: Windows har nu tilläggats till startmenun. Menun syns alltid när man startar om datorn.

source: Abitti-compatible eExam-system is not updated when running Windows, you have to boot into the current system to update it.
de: Achtung Abitti-kompatibles elektronisches Testsystem wird nicht aktualisiert bei Windows-Betriebssystem. Sie müssen zu diesem laufenden Betriebssystem booten um auch das Testsystem zu aktualisieren.
fi: Huomioi, että Abitti-yhteensopivaa koejärjestelmää ei päivitetä silloin, kun tietokone on käynnistetty Windowsiin. Vaihtaaksesi/päivittääksesi kannettavan koejärjestelmäversiota, sinun tulee valita tietokoneen käynnistyksen yhteydessä 'Normaali käynnistys' ja käynnistää tähän nyt käytössä olevaan Opinsys OS -käyttöjärjestelmään.
sv: Obs! Abitti-kompatibel exam-system uppdateras inte när datorn har startats till Windows. För att byta / uppdatera din laptops Abitti-system måste man välja normal start och välja det här Opinsys Os som används nu.

source: error saving changes
de: Fehler beim Speichern der Veränderungen
fi: virhe tallennuksessa
sv: fel i sparning av ändringarna

source: Factory reset is running step
de: Das Zurücksetzen der Werkseinstellungen Schritt
fi: Tehdasasetusten palautus on käynnissä vaiheessa
sv: Fabriksåterställning kör steg

source: Factory reset is running
de: Das Zurücksetzen der Werkseinstellungen wird durchgeführt
fi: Tehdasasetusten palautus on käynnissä
sv: Fabriksåterställning pågår

source: Failed to start factory reset
de: Das Zurücksetzen der Werkseinstellungen konnte nicht gestartet werden
fi: Tehdasasetusten palautuksen käynnistys epäonnistui
sv: Fabriksåterställningen kunde inte börjas

source: Factory reset failed
de: Das Zurücksetzen der Werkseinstellungen ist gescheitert
fi: Tehdasasetusten palautus epäonnistui
sv: Fabriksåterställningen mislyckades

source: Factory reset succeeded.
de: Das Zurücksetzen der Werkseinstellungen ist gefolgt.
fi: Tehdasasetusten palautus onnistui.

source: The system is going to reboot in few seconds...
de: Das System wird in einigen Sekunden neugestartet.
fi: Järjestelmä käynnistyy uudestaan muutaman sekunnin kuluessa...

source: Further details can be found from the factory reset log. Please contact support for assistance.
de: Weitere Informationen können aus der Werkseinstellungslog gelesen werden. Bitte Kontakt mit Helpdesk aufnehmen.
fi: Tarkemmat tiedot virheestä löytyvät tehdasasetusten palautuslokista. Olkaa hyvä ja ottakaa yhteyttä tukeen ongelman selvittämiseksi.
sv: Ytterligare detaljer kan hittas från fabriksåterställningsloggen. Kontakta supporten för hjälp.

source: Laptop setup
de: Laptop Einstellungen
fi: Kannettavan asetukset
sv: Laptop inställningar

source: You do not have the required permissions to use this tool.
de: Sie haben nicht ausreichende Rechte um dieses Werkzeug zu verwenden
fi: Sinulla ei ole tarvittavia oikeuksia tämän työkalun käyttöön.
sv: Du har inte tillräckliga rättigheter att använda verktyget.

source: is already running
de: schon im Gang
fi: on jo käynnissä
sv: är redan igång

source: eExam-system version (Abitti-compatible)
de: Version des elektronischen Testsystems (Abitti-kompatibel)
fi: Koejärjestelmäversio (Abitti-yhteensopiva)
sv: eProv-systemversion (Abitti-kompatibel)

source: Show developer mode in boot menu
de: Entwicklungsmodus beim Startmenü zeigen
fi: Näytä kehittäjätila tietokonetta käynnistettäessä
sv: Visa utvecklarläge i startmenyn

source: Default operating system at boot
de: Standardbetriebssystem beim Starten
fi: Oletuksena käynnistettävä järjestelmä
sv: Standardoperativsystem i starten

source: latest version
de: Die letzte version
fi: viimeisin versio
sv: den senaste versionen

source: school version
de: Schulversion
fi: koulun versio
sv: skolversion

source: this version:
de: Diese Version:
fi: tämä versio:
sv: den här versionen:

source: eExam-system
de: Elektronisches Test-System (Abitti)
fi: Koejärjestelmä
sv: eProv-system Abitti

source: Start using Windows
de: Windows aktivieren
fi: Ota Windows käyttöön
sv: Aktivera Windows

source: Factory reset...
de: Das Zurücksetzen der Werkseinstellungen...
fi: Tehdasasetusten palautus...

source: Confirmation of factory reset
de: Bestätigung des Zurücksetzens auf die Werkseinstellungen
fi: Vahvistus tehdasasetusten palautukselle

source: Cancel
de: Absagen
fi: Peruuta

source: Reset
de: Zurücksetzen
fi: Palauta tehdasasetuksille

source: Select operating systems to reset:
de: Wählen Sie die Betriebssysteme zum Zurücksetzen aus:
fi: Valitse tehdasasetuksille palautettavat käyttöjärjestelmät:

source: <big>Factory reset <span foreground="red" size="x-large">erases all user data</span> from selected operating systems and restores their state to factory settings!</big>
de: <big>Beim Zurücksetzen auf die Werkseinstellungen <span foreground="red" size="x-large"> werden alle Benutzerdaten</span> von ausgewählten Betriebssystemen <span foreground="red" size="x-large">gelöscht</span> und deren Zustand auf die Werkseinstellungen zurückgesetzt!</big>
fi: <big>Tehdasasetusten palautus <span foreground="red" size="x-large">tuhoaa kaiken datan</span> valituista käyttöjärjestelmistä ja palauttaa ne takaisin tehdasasetuksille!</big>

source: Factory reset
de: Das Zurücksetzen der Werkseinstellungen
fi: Tehdasasetusten palautus
sv: Fabriksåterställning

source: Close
de: Schließen
fi: Sulje
sv: Stäng

source: Factory reset log
de: Protokoll zum Zurücksetzen der Werkseinstellungen
fi: Tehdaasetusten palautusloki
sv: Fabriksåterställningslogg

source: DANGER! DANGER!
sv: FARA! FARA!

source: THIS PROCEDURE WILL RESET THIS COMPUTER TO FACTORY STATE! IT WILL DESTROY ALL YOUR DATA IN YOUR HOME DIRECTORY, AND MORE! WHEN IN DOUBT, TURN OFF THE MACHINE, PANIC AND RUN AWAY! (press OK and provide your password if you still want to do this.)
sv: DENNA PROCEDUR KOMMER ATT ÅTERSTÄLLA DENNA DATOR TILL FABRIKSINSTÄLLNINGARNA. DET KOMMER FÖRSTÖRA ALL DATA I HEMKATALOG OCH MERA! OM DU TVIVLAR - STÄNG DATOR, GÅ I PANIK OCH SPRING BORT! (Tryck OK och ge ditt lösenord om du ändå vill göra det här.)

source: Factory reset succeeded. The system is going to reboot in few seconds...
sv: Fabriksåterställningen lyckades. Systemet startar om i några sekunder...

source: Destroy all user data and reset laptop to factory state (requires password)
sv: Förstör all data och återställ datorn till fabriksinställningarna (kräver lösenord)
