Repository: puavo-org/puavo-os
Catalog: debs/openldap/debian/po/*.po
Languages: tr

source: Omit OpenLDAP server configuration?
tr: OpenLDAP sunucu yapılandırması atlansın mı?

source: If you enable this option, no initial configuration or database will be created for you.
tr: Bu seçeneği seçmeniz durumunda sizin için ne bir ön yapılandırma yapılacak ne de bir veritabanı yaratılacak.

source: always
tr: her zaman

source: when needed
tr: gerektiğinde

source: never
tr: hiçbir zaman

source: Dump databases to file on upgrade:
tr: Yükseltme sırasında veritabanlarının dökümü yapılsın mı?:

source: Before upgrading to a new version of the OpenLDAP server, the data from your LDAP directories can be dumped into plain text files in the standard LDAP Data Interchange Format.
tr: Makineniz yeni OpenLDAP sunucu sürümüne yükseltilmeden önce, LDAP dizinlerindeki verileriniz LDAP Veri Değişimi Biçimi'nde (LDIF) metin dosyalarına yedeklenebilir.

source: Selecting "always" will cause the databases to be dumped unconditionally before an upgrade. Selecting "when needed" will only dump the database if the new version is incompatible with the old database format and it needs to be reimported. If you select "never", no dump will be done.
tr: "her zaman" seçimi veritabanlarının yükseltme öncesinde kayıtsız şartsız bir dökümünü sağlayacaktır. "gerektiğinde" seçimi yeni ile eski sürüm arasında veritabanı biçim farklılığı varsa ve bu nedenle yeni veritabanına eski verilerin sonradan alınması gerekirse döküm yapacaktır. "hiçbir zaman" seçeneğini seçerseniz döküm yapılmayacaktır.

source: Directory to use for dumped databases:
tr: Veritabanı dökümü için kullanılacak dizin:

source: Please specify the directory where the LDAP databases will be exported. In this directory, several LDIF files will be created which correspond to the search bases located on the server. Make sure you have enough free space on the partition where the directory is located. The first occurrence of the string "VERSION" is replaced with the server version you are upgrading from.
tr: LDAP veritabanlarının dışa aktarımı için bir dizin belirtiniz. Bu dizine sunucuda varolan arama tabanlarına karşılık gelen bir çok LDIF dosyası kaydedilecektir. İlgili dizinin bulunduğu disk bölümünde yeterince boş alan olduğundan emin olunuz. "VERSION" dizgesi ilk görüldüğü yerde yükseltme işleminden önceki sunucu sürümünüzle değiştirilecektir.

source: Move old database?
tr: Eski veritabanı taşınsın mı?

source: There are still files in /var/lib/ldap which will probably break the configuration process. If you enable this option, the maintainer scripts will move the old database files out of the way before creating a new database.
tr: /var/lib/ldap dizininde yapılandırma sürecini bozabilecek bazı dosyalar bulunmaktadır. Bu seçeneği seçerseniz, bakımcı betikleri yeni bir veritabanı yaratmadan önce bu eski veritabanı dosyalarını başka bir yere taşıyacaktır.

source: Retry configuration?
tr: Yapılandırma yeniden denensin mi?

source: The configuration you entered is invalid. Make sure that the DNS domain name is syntactically valid, the field for the organization is not left empty and the admin passwords match. If you decide not to retry the configuration the LDAP server will not be set up. Run 'dpkg-reconfigure slapd' if you want to retry later.
tr: Girdiğiniz yapılandırma ayarları geçersiz. DNS alan adının sözdizimsel olarak geçerli olduğundan, örgüt adı için ayrılmış alanın boş olmadığından ve yönetici parolalarının uyumlu olduğundan emin olunuz. Yapılandırmayı yeniden denemeyi seçmezseniz LDAP sunucu kurulmayacaktır. Kurulumu sonra denemek isterseniz, 'dpkg-reconfigure slapd' komutunu çalıştırın.

source: DNS domain name:
tr: DNS alan adı:

source: The DNS domain name is used to construct the base DN of the LDAP directory. For example, 'foo.example.org' will create the directory with 'dc=foo, dc=example, dc=org' as base DN.
tr: DNS alan adı LDAP dizinin temel DN yapılandırması için kullanılmıştır. Örneğin, 'gecici.example.org' alan adı 'dc=gecici, dc=example, dc=org' temel DN'ye sahip dizini yaratacaktır.

source: Organization name:
tr: Örgüt adı:

source: Please enter the name of the organization to use in the base DN of your LDAP directory.
tr: LDAP dizininizin temel DN'si olarak kullanılacak örgüt adını giriniz.

source: Administrator password:
tr: Yönetici parolası:

source: Please enter the password for the admin entry in your LDAP directory.
tr: LDAP dizini yöneticisi için parola giriniz.

source: Confirm password:
tr: Parolayı doğrulayınız:

source: Please enter the admin password for your LDAP directory again to verify that you have typed it correctly.
tr: LDAP dizini yönetici parolasını tekrar giriniz ve doğru yazdığınızdan emin olunuz.

source: Password mismatch
tr: Parola uyumsuzluğu

source: The two passwords you entered were not the same. Please try again.
tr: Girdiğiniz iki parola aynı değil, lütfen tekrar deneyiniz.

source: Do you want the database to be removed when slapd is purged?
tr: slapd paketi tamamen kaldırıldığında veritabanının da kaldırılmasını ister misiniz?

source: slapcat failure during upgrade
tr: Yükseltme sırasında 'slapcat' hatası

source: An error occurred while upgrading the LDAP directory.
tr: LDAP dizini yükseltilirken bir hata oluştu.

source: The 'slapcat' program failed while extracting the LDAP directory. This may be caused by an incorrect configuration file (for example, missing 'moduleload' lines to support the backend database).
tr: 'slapcat' programı LDAP dizinini dışa aktarırken başarısız oldu. Buna hatalı bir yapılandırma dosyası neden olmuş olabilir (örneğin, arka uç veritabanlarını desteklemek için gerekli 'moduleload' satırlarının eksik olması gibi).

source: This failure will cause 'slapadd' to fail later as well. The old database files will be moved to /var/backups. If you want to try this upgrade again, you should move the old database files back into place, fix whatever caused slapcat to fail, and run:
tr: Bu hata 'slapadd' programının da hata vermesine neden olacaktır. Eski veritabanı dosyaları /var/backups dizinine taşınacaktır. Eğer bu yükseltmeyi yeniden denemek isterseniz, eski veritabanı dosyalarını yerlerine geri almalı, 'slapcat' programının hatasına neden olan her ne ise düzeltmeli ve aşağıdaki komutu çalıştırmalısınız:

source: Then move the database files back to a backup area and then try running slapadd from ${location}.
tr: Daha sonra veritabanı dosyalarını bir yedekleme alanına geri taşıyın ve ${location} konumundan 'slapadd' komutunu çalıştırınız.

source: Potentially unsafe slapd access control configuration
tr: Olası güvensiz slapd erişim denetimi yapılandırması

source: One or more of the configured databases has an access control rule that allows users to modify most of their own attributes. This may be unsafe, depending on how the database is used.
tr: Yapılandırılmış bir ya da daha fazla veritabanında, kullanıcıların kendilerine ait bir çok özelliği değiştirmesine izin veren bir erişim denetimi kuralı var. Bu durum, veritabanı kullanım şekline bağlı olarak, güvenli olmayabilir.

source: In the case of slapd access rules that begin with "to *", it is recommended to remove any instances of "by self write", so that users are only able to modify specifically allowed attributes.
tr: "to *" ile başlayan slapd erişim kurallarında, kullanıcıların yalnızca değiştirilmesine izin verilmiş özellikleri değiştirebilmeleri için, tüm "by self write" alanlarının kaldırılması önerilir.

source: See /usr/share/doc/slapd/README.Debian.gz for more details.
tr: Daha fazla bilgi için /usr/share/doc/slapd/README.Debian.gz dosyasını okuyunuz.

source: abort installation
tr: kurulumdan çık

source: continue regardless
tr: yine de sürdür

source: Manual ppolicy schema update recommended
tr: ppolicy şemasının elle yükseltilmesi öneriliyor

source: The new version of the Password Policy (ppolicy) overlay requires the schema to define the pwdMaxRecordedFailure attribute type, which is not present in the schema currently in use. It is recommended to abort the upgrade now, and to update the ppolicy schema before upgrading slapd. If replication is in use, the schema update should be applied on every server before continuing with the upgrade.
tr: Parola ilkesi katmanının (ppolicy) yeni sürümü, şu anda kullanılmakta olan şemanın içermediği pwdMaxRecordedFailure özniteliğinin şemada tanımlanmasını gerektiriyor. Şimdi kurulumdan çıkmanız ve slapd yükseltmesine başlamadan önce ppolicy şemasını güncellemeniz önerilir. Eğer dizinlerinizi kopyalayan başka sunucular varsa, yükseltmeye başlamadan önce bütün sunuculardaki şemaları güncellemeniz gerekiyor.

source: An LDIF file has been generated with the changes required for the upgrade:
tr: Yükseltme için gerekli değişiklikleri içeren bir LDIF dosyası oluşturuldu:

source: so if slapd is using the default access control rules, these changes can be applied (after starting slapd) by using the command:
tr: Eğer slapd öntanımlı erişim denetimi kurallarını kullanıyorsa, bu değişiklikler slapd başlatıldıktan sonra aşağıdaki komutu çalıştırarak uygulanabilir:

source: If instead you choose to continue the installation, the new attribute type will be added automatically, but the change will not be acted on by slapd overlays, and replication with other servers may be affected.
tr: Eğer kurulumu sürdürmeyi yeğlerseniz, yeni öznitelik kendiliğinden eklenecek fakat bu değişim slapd katmanlarında hayata geçmeyecek ve dizinleri kopyalayan sunucular varsa bu durumdan etkilenebileceklerdir.
